MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF124/mcu.h
#define _IPC8_IC7IS_POSITION                     0x00000010
#define _IPC8_IC7IS_MASK                         0x00030000
#define _IPC8_IC7IS_LENGTH                       0x00000002

#define _IPC8_IC7IP_POSITION                     0x00000012
#define _IPC8_IC7IP_MASK                         0x001C0000
#define _IPC8_IC7IP_LENGTH                       0x00000003

#define _IPC8_OC7IS_POSITION                     0x00000018
#define _IPC8_OC7IS_MASK                         0x03000000
#define _IPC8_OC7IS_LENGTH                       0x00000002

#define _IPC8_OC7IP_POSITION                     0x0000001A
#define _IPC8_OC7IP_MASK                         0x1C000000
#define _IPC8_OC7IP_LENGTH                       0x00000003

#define _IPC8_w_POSITION                         0x00000000
#define _IPC8_w_MASK                             0xFFFFFFFF
#define _IPC8_w_LENGTH                           0x00000020

#define _IPC9_T8IS_POSITION                      0x00000000
#define _IPC9_T8IS_MASK                          0x00000003
#define _IPC9_T8IS_LENGTH                        0x00000002

#define _IPC9_T8IP_POSITION                      0x00000002
#define _IPC9_T8IP_MASK                          0x0000001C
#define _IPC9_T8IP_LENGTH                        0x00000003

#define _IPC9_IC8EIS_POSITION                    0x00000008
#define _IPC9_IC8EIS_MASK                        0x00000300
#define _IPC9_IC8EIS_LENGTH                      0x00000002

#define _IPC9_IC8EIP_POSITION                    0x0000000A
#define _IPC9_IC8EIP_MASK                        0x00001C00
#define _IPC9_IC8EIP_LENGTH                      0x00000003

#define _IPC9_IC8IS_POSITION                     0x00000010
#define _IPC9_IC8IS_MASK                         0x00030000
#define _IPC9_IC8IS_LENGTH                       0x00000002

#define _IPC9_IC8IP_POSITION                     0x00000012
#define _IPC9_IC8IP_MASK                         0x001C0000
#define _IPC9_IC8IP_LENGTH                       0x00000003

#define _IPC9_OC8IS_POSITION                     0x00000018
#define _IPC9_OC8IS_MASK                         0x03000000
#define _IPC9_OC8IS_LENGTH                       0x00000002

#define _IPC9_OC8IP_POSITION                     0x0000001A
#define _IPC9_OC8IP_MASK                         0x1C000000
#define _IPC9_OC8IP_LENGTH                       0x00000003

#define _IPC9_w_POSITION                         0x00000000
#define _IPC9_w_MASK                             0xFFFFFFFF
#define _IPC9_w_LENGTH                           0x00000020

#define _IPC10_T9IS_POSITION                     0x00000000
#define _IPC10_T9IS_MASK                         0x00000003
#define _IPC10_T9IS_LENGTH                       0x00000002

#define _IPC10_T9IP_POSITION                     0x00000002
#define _IPC10_T9IP_MASK                         0x0000001C
#define _IPC10_T9IP_LENGTH                       0x00000003

#define _IPC10_IC9EIS_POSITION                   0x00000008
#define _IPC10_IC9EIS_MASK                       0x00000300
#define _IPC10_IC9EIS_LENGTH                     0x00000002

#define _IPC10_IC9EIP_POSITION                   0x0000000A
#define _IPC10_IC9EIP_MASK                       0x00001C00
#define _IPC10_IC9EIP_LENGTH                     0x00000003

#define _IPC10_IC9IS_POSITION                    0x00000010
#define _IPC10_IC9IS_MASK                        0x00030000
#define _IPC10_IC9IS_LENGTH                      0x00000002

#define _IPC10_IC9IP_POSITION                    0x00000012
#define _IPC10_IC9IP_MASK                        0x001C0000
#define _IPC10_IC9IP_LENGTH                      0x00000003

#define _IPC10_OC9IS_POSITION                    0x00000018
#define _IPC10_OC9IS_MASK                        0x03000000
#define _IPC10_OC9IS_LENGTH                      0x00000002

#define _IPC10_OC9IP_POSITION                    0x0000001A
#define _IPC10_OC9IP_MASK                        0x1C000000
#define _IPC10_OC9IP_LENGTH                      0x00000003

#define _IPC10_w_POSITION                        0x00000000
#define _IPC10_w_MASK                            0xFFFFFFFF
#define _IPC10_w_LENGTH                          0x00000020

#define _IPC11_ADCIS_POSITION                    0x00000000
#define _IPC11_ADCIS_MASK                        0x00000003
#define _IPC11_ADCIS_LENGTH                      0x00000002

#define _IPC11_ADCIP_POSITION                    0x00000002
#define _IPC11_ADCIP_MASK                        0x0000001C
#define _IPC11_ADCIP_LENGTH                      0x00000003

#define _IPC11_ADCFIFOIS_POSITION                0x00000008
#define _IPC11_ADCFIFOIS_MASK                    0x00000300
#define _IPC11_ADCFIFOIS_LENGTH                  0x00000002

#define _IPC11_ADCFIFOIP_POSITION                0x0000000A
#define _IPC11_ADCFIFOIP_MASK                    0x00001C00
#define _IPC11_ADCFIFOIP_LENGTH                  0x00000003

#define _IPC11_ADCDC1IS_POSITION                 0x00000010
#define _IPC11_ADCDC1IS_MASK                     0x00030000
#define _IPC11_ADCDC1IS_LENGTH                   0x00000002

#define _IPC11_ADCDC1IP_POSITION                 0x00000012
#define _IPC11_ADCDC1IP_MASK                     0x001C0000
#define _IPC11_ADCDC1IP_LENGTH                   0x00000003

#define _IPC11_ADCDC2IS_POSITION                 0x00000018
#define _IPC11_ADCDC2IS_MASK                     0x03000000
#define _IPC11_ADCDC2IS_LENGTH                   0x00000002

#define _IPC11_ADCDC2IP_POSITION                 0x0000001A
#define _IPC11_ADCDC2IP_MASK                     0x1C000000
#define _IPC11_ADCDC2IP_LENGTH                   0x00000003

#define _IPC11_w_POSITION                        0x00000000
#define _IPC11_w_MASK                            0xFFFFFFFF
#define _IPC11_w_LENGTH                          0x00000020

#define _IPC12_ADCDC3IS_POSITION                 0x00000000
#define _IPC12_ADCDC3IS_MASK                     0x00000003
#define _IPC12_ADCDC3IS_LENGTH                   0x00000002

#define _IPC12_ADCDC3IP_POSITION                 0x00000002
#define _IPC12_ADCDC3IP_MASK                     0x0000001C
#define _IPC12_ADCDC3IP_LENGTH                   0x00000003

#define _IPC12_ADCDC4IS_POSITION                 0x00000008
#define _IPC12_ADCDC4IS_MASK                     0x00000300
#define _IPC12_ADCDC4IS_LENGTH                   0x00000002

#define _IPC12_ADCDC4IP_POSITION                 0x0000000A
#define _IPC12_ADCDC4IP_MASK                     0x00001C00
#define _IPC12_ADCDC4IP_LENGTH                   0x00000003

