MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF124/mcu.h
#define _CNNEH_CNNEH6_POSITION                   0x00000006
#define _CNNEH_CNNEH6_MASK                       0x00000040
#define _CNNEH_CNNEH6_LENGTH                     0x00000001

#define _CNNEH_CNNEH8_POSITION                   0x00000008
#define _CNNEH_CNNEH8_MASK                       0x00000100
#define _CNNEH_CNNEH8_LENGTH                     0x00000001

#define _CNNEH_CNNEH9_POSITION                   0x00000009
#define _CNNEH_CNNEH9_MASK                       0x00000200
#define _CNNEH_CNNEH9_LENGTH                     0x00000001

#define _CNNEH_CNNEH10_POSITION                  0x0000000A
#define _CNNEH_CNNEH10_MASK                      0x00000400
#define _CNNEH_CNNEH10_LENGTH                    0x00000001

#define _CNNEH_CNNEH12_POSITION                  0x0000000C
#define _CNNEH_CNNEH12_MASK                      0x00001000
#define _CNNEH_CNNEH12_LENGTH                    0x00000001

#define _CNNEH_CNNEH13_POSITION                  0x0000000D
#define _CNNEH_CNNEH13_MASK                      0x00002000
#define _CNNEH_CNNEH13_LENGTH                    0x00000001

#define _CNFH_CNFH0_POSITION                     0x00000000
#define _CNFH_CNFH0_MASK                         0x00000001
#define _CNFH_CNFH0_LENGTH                       0x00000001

#define _CNFH_CNFH1_POSITION                     0x00000001
#define _CNFH_CNFH1_MASK                         0x00000002
#define _CNFH_CNFH1_LENGTH                       0x00000001

#define _CNFH_CNFH4_POSITION                     0x00000004
#define _CNFH_CNFH4_MASK                         0x00000010
#define _CNFH_CNFH4_LENGTH                       0x00000001

#define _CNFH_CNFH5_POSITION                     0x00000005
#define _CNFH_CNFH5_MASK                         0x00000020
#define _CNFH_CNFH5_LENGTH                       0x00000001

#define _CNFH_CNFH6_POSITION                     0x00000006
#define _CNFH_CNFH6_MASK                         0x00000040
#define _CNFH_CNFH6_LENGTH                       0x00000001

#define _CNFH_CNFH8_POSITION                     0x00000008
#define _CNFH_CNFH8_MASK                         0x00000100
#define _CNFH_CNFH8_LENGTH                       0x00000001

#define _CNFH_CNFH9_POSITION                     0x00000009
#define _CNFH_CNFH9_MASK                         0x00000200
#define _CNFH_CNFH9_LENGTH                       0x00000001

#define _CNFH_CNFH10_POSITION                    0x0000000A
#define _CNFH_CNFH10_MASK                        0x00000400
#define _CNFH_CNFH10_LENGTH                      0x00000001

#define _CNFH_CNFH12_POSITION                    0x0000000C
#define _CNFH_CNFH12_MASK                        0x00001000
#define _CNFH_CNFH12_LENGTH                      0x00000001

#define _CNFH_CNFH13_POSITION                    0x0000000D
#define _CNFH_CNFH13_MASK                        0x00002000
#define _CNFH_CNFH13_LENGTH                      0x00000001

#define _ANSELJ_ANSJ8_POSITION                   0x00000008
#define _ANSELJ_ANSJ8_MASK                       0x00000100
#define _ANSELJ_ANSJ8_LENGTH                     0x00000001

#define _ANSELJ_ANSJ9_POSITION                   0x00000009
#define _ANSELJ_ANSJ9_MASK                       0x00000200
#define _ANSELJ_ANSJ9_LENGTH                     0x00000001

#define _ANSELJ_ANSJ11_POSITION                  0x0000000B
#define _ANSELJ_ANSJ11_MASK                      0x00000800
#define _ANSELJ_ANSJ11_LENGTH                    0x00000001

#define _ANSELJ_w_POSITION                       0x00000000
#define _ANSELJ_w_MASK                           0xFFFFFFFF
#define _ANSELJ_w_LENGTH                         0x00000020

#define _TRISJ_TRISJ0_POSITION                   0x00000000
#define _TRISJ_TRISJ0_MASK                       0x00000001
#define _TRISJ_TRISJ0_LENGTH                     0x00000001

#define _TRISJ_TRISJ1_POSITION                   0x00000001
#define _TRISJ_TRISJ1_MASK                       0x00000002
#define _TRISJ_TRISJ1_LENGTH                     0x00000001

#define _TRISJ_TRISJ2_POSITION                   0x00000002
#define _TRISJ_TRISJ2_MASK                       0x00000004
#define _TRISJ_TRISJ2_LENGTH                     0x00000001

#define _TRISJ_TRISJ4_POSITION                   0x00000004
#define _TRISJ_TRISJ4_MASK                       0x00000010
#define _TRISJ_TRISJ4_LENGTH                     0x00000001

#define _TRISJ_TRISJ8_POSITION                   0x00000008
#define _TRISJ_TRISJ8_MASK                       0x00000100
#define _TRISJ_TRISJ8_LENGTH                     0x00000001

#define _TRISJ_TRISJ9_POSITION                   0x00000009
#define _TRISJ_TRISJ9_MASK                       0x00000200
#define _TRISJ_TRISJ9_LENGTH                     0x00000001

#define _TRISJ_TRISJ11_POSITION                  0x0000000B
#define _TRISJ_TRISJ11_MASK                      0x00000800
#define _TRISJ_TRISJ11_LENGTH                    0x00000001

#define _TRISJ_w_POSITION                        0x00000000
#define _TRISJ_w_MASK                            0xFFFFFFFF
#define _TRISJ_w_LENGTH                          0x00000020

#define _PORTJ_RJ0_POSITION                      0x00000000
#define _PORTJ_RJ0_MASK                          0x00000001
#define _PORTJ_RJ0_LENGTH                        0x00000001

#define _PORTJ_RJ1_POSITION                      0x00000001
#define _PORTJ_RJ1_MASK                          0x00000002
#define _PORTJ_RJ1_LENGTH                        0x00000001

#define _PORTJ_RJ2_POSITION                      0x00000002
#define _PORTJ_RJ2_MASK                          0x00000004
#define _PORTJ_RJ2_LENGTH                        0x00000001

#define _PORTJ_RJ4_POSITION                      0x00000004
#define _PORTJ_RJ4_MASK                          0x00000010
#define _PORTJ_RJ4_LENGTH                        0x00000001

#define _PORTJ_RJ8_POSITION                      0x00000008
#define _PORTJ_RJ8_MASK                          0x00000100
#define _PORTJ_RJ8_LENGTH                        0x00000001

#define _PORTJ_RJ9_POSITION                      0x00000009
#define _PORTJ_RJ9_MASK                          0x00000200
#define _PORTJ_RJ9_LENGTH                        0x00000001

#define _PORTJ_RJ11_POSITION                     0x0000000B
#define _PORTJ_RJ11_MASK                         0x00000800
#define _PORTJ_RJ11_LENGTH                       0x00000001

#define _PORTJ_w_POSITION                        0x00000000
#define _PORTJ_w_MASK                            0xFFFFFFFF
#define _PORTJ_w_LENGTH                          0x00000020

#define _LATJ_LATJ0_POSITION                     0x00000000
#define _LATJ_LATJ0_MASK                         0x00000001
#define _LATJ_LATJ0_LENGTH                       0x00000001

#define _LATJ_LATJ1_POSITION                     0x00000001
#define _LATJ_LATJ1_MASK                         0x00000002
#define _LATJ_LATJ1_LENGTH                       0x00000001

#define _LATJ_LATJ2_POSITION                     0x00000002
#define _LATJ_LATJ2_MASK                         0x00000004
#define _LATJ_LATJ2_LENGTH                       0x00000001

#define _LATJ_LATJ4_POSITION                     0x00000004
#define _LATJ_LATJ4_MASK                         0x00000010
#define _LATJ_LATJ4_LENGTH                       0x00000001

